# CommitPendingTransaction Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailuresAccessor..::..CommitPendingTransaction Method
FailuresAccessor Class See Also
---
Finishes pending failures processing by committing the pending transaction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TransactionStatus CommitPendingTransaction()
```

Visual Basic
---
```text
Public Function CommitPendingTransaction As TransactionStatus
```

Visual C++
---
```text
public:
TransactionStatus CommitPendingTransaction()
```

# ### Return Value
Result of attempt to commit the pending transaction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). -or- The processing of the failures is not in the pending state. -or- There is no pending transaction or transaction is not allowed to be committed. |

# See Also
FailuresAccessor Class
Autodesk.Revit.DB Namespace